module.exports={
    msg :{
            welcome:`از اینکه به جمع میلیونی ما پیوستید خرسندیم. با استفاده از این ربات میتونی برای خودت دوست های زیادی پیدا کنی. 
             فقط حواست باشه حرمت ها رو حفظ کنی و سوء استفاده نکنی وگرنه توسط ربات بلاک میشی و دیگه نمیتونی از ربات استفاده کنی`,
            error:`مشکلی در سیستم یا در محتوای ارسالی شما وجود دارد
لطفا مجدد امتحان کنید`,

            loading:"در حال پردازش تصویر لطفا منتظر بمانید",
            face:`این افکت بروی صورت اعمال میشود 
لطفا عکسی از صورت خود را ارسال کنید`,
            expire:"عکس ارسالی منقضی شده است لطفا عکس مورد نظر را ذوباره آپلود کنید",

            link:`دوست عزیز شما از نسخه آزمایشی ربات استفاده کردید.
برای پیدا کردن دوستای بیشتر می بایست از نسخه طلایی استفاده کنید، جهت ارتقا به نسخه طلایی ابتدا عضو کانال چه خوب! شده و سپس 5 نفر از دوستان خود را از طریق لینک زیر به ربات دعوت کنید تا اکانت طلایی برای شما فعال شود🌹
~link
تعداد افراد دعوت شده توسط شما تا کنون ~count نفر است`,

            invitedpass:`تبریک !!!
            نسخه طلایی برای شما فعال شد
لطفا برای کار با ربات از دکمه های پایین استفاده کنید
           `,
            caption:'عکس خودتو توسط ربات زیر ویرایش کن @~botname',
            blocked:`اکانت شما توسط مدیر به علت استفاده نادرست از ربات بلاک شد`,
                        notice:`هشدار
لطفا عکس مستهجن تو ربات آپلود نکن 
سری بعدی هشدار داده نمیشه و بلاک میشی
و دیگه نمیتونی از ربات استفاده کنی 😡`,
                        done:"عملیات با موفقیت انجام شد",
        canceled:"عملیات کنسل شد",
        search:"تمایل داری با دختر صحبت کنی یا پسر؟",
        ageSearch:`دوس داری کسی که پیدا میشه کمتر از سن خودت باشه یا بیشتر؟ 
      `,
        sexChange:"دختری یا پسر؟",
        ageChange:"چند سالته؟",
        cityChange:"شهر خود را وارد کنید",
        photoChange:"عکس خود را ارسال کنید",
        sexChanged:"جنسیت  تغییر کرد  ",
        ageChanged:"سن  تغییر کرد  ",
        cityChanged:"شهر  تغییر کرد  ",
        photoChanged:"عکس  تغییر کرد  ",
        blackList:"لیست کاربرای بلاک شده اگه میخوای کسی رو از این لیست خارج کنی رو دکمه مربوط بهش کلیک کن",
        ageRec:"اگه میخوای بهتر جستوجو کنی لطفا سنتو از دکمه های زیر تغییر بده ",

        sexSet:`جنسیت  تنظیم شد
لطفا برای شروع کار با ربات از دکمه های زیر استفاده کنید `,
        searching:"در حال جستوجو... لطفا صبور باشید",
        find:"نتیجه جستجوی شما:",
        youCancel:"اشکال نداره، میریم سراغ نفر بعدی ",
        youCancelRequest:"اشکال نداره، میریم سراغ نفر بعدی ",
        itCancel:"متاسفانه ~name تمایلی به صحبت با شما نداره. در حال جستجو برای پیدا کردن شخص جدید، لطفا صبور باشید...",
        itDeny:"متاسفانه ~name دیگه تمایلی به صحبت با شما نداره. در حال جستجو برای پیدا کردن شخص جدید، لطفا صبور باشید...",
        connected:"امیدوارم دوستای خوبی برای هم بشید، صفحه چت شما با هم بازه و از الان میتونین با هم چت کنید. تو صفحه چتتون میتونین اضافه بر ارسال متن؛  عکس و فیلم و وویس و آهنگ و استکیر و کلی چیزای دیگه به هم بفرستین . فقط حواستون باشه چرت و پرتی نفرستین که توسط ربات بلاک میشین و دیگه نمیتونین از ربات استفاده کنین. هر موقع خواستی میتونی با دکمه انصراف از چت رو بزنی و چتو کنسل کنی ",
        youDeny:"فرد مورد نظر متصل شد",
        infoCompleted:`
        اطلاعات شما تکمیل شد. برای تغییر اطلاعات از دکمه های زیر میتونی استفاده کنی،
         برای جستجوی دوست لطفا روی گزینه جستجو کلیک کن
         و تا زمانی که دوستی پیدا نکردی ازش خارج نشو. امیدوارم دوستای زیادی پیدا کنی.`,
      comment:"لطفا نظر خود را وارد کنید یا  اگه نمیخوای انصراف بزن",
      location:"موقعیت مکانی ذخیره شد",
      daylimit:"تعداد استفاده روزانه ی شما تمام شد",
        waiting:"درخواست دوستی شما به طرف مقابل ارسال شد. پیشنهاد میکنیم ۳ تا ۵ دقیقه منتظر جواب ایشون بمونی و در صورتیکه مدت زمان انتظار برای پاسخ دهی ایشون طولانی شد از دکمه انصراف استفاده کنی و دوباره وارد صفحه جستجو بشی.",
        waitingForYou:" ~name تمایل داره که با شما وارد صحبت بشه، آیا شما هم دوست داری با ایشون صحبت کنی؟ ",
        help:`راهنمای استفاده از ربات دوست یابی:
اول از همه عکستو آپلود کن تو ربات. برای آپلود عکس گزینه گیره کنار همین قسمت چت رو بزن ، عکستو از تو گالری انتخاب کن و ارسال رو بزن. عکسی رو انتخاب کن که صورتت تو عکس مشخص باشه . همون عکس رو ربات بهت میده و زیرش یه تعداد دکمه میاد. هر دکمه ای رو بزنی بهت عکستو با یه حالت مختلف میده، یکی کارتونی میکنه، یکی با مداد رنگی نقاشی میکنه، یکی با مداد سیاه طراحی میکنه و ... 
امیدوارم عکسای قشنگی رو واسه خودت و اطرافیات درست کنی، اگه از ربات راضی هستی به دوستات هم ربات رو معرفی کن تا اونا هم بتونن عکسای قشنگی رو درست کنن`,
        },
   consts:{
       botname:"RaazFriendshipbot",
   },
   markups:{
       channel:blockerbot.inlineKeyboard(
           [
               [blockerbot.inlineButton(`عضویت در کانال چه خوب!`, {url:  "https://t.me/joinchat/AAAAAEHgwgYWBrgHhwevKg"})]
           ]
           ),
       verifyConnect:blockerbot.inlineKeyboard(
           [
               [blockerbot.inlineButton('قبول', {callback:  "connect-verify"})],
               [blockerbot.inlineButton('رد کن', {callback:  "connect-deny"})]
           ]
       ),
       denyWaiting:blockerbot.inlineKeyboard(
           [
               [blockerbot.inlineButton('بیخیال شدم', {callback:  "waiting-deny"})]
           ]
       ),
       sexForChange:blockerbot.inlineKeyboard(
           [
               [blockerbot.inlineButton('دختر', {callback:  "sexc-w"})],
               [blockerbot.inlineButton('پسر', {callback:  "sexc-m"})]
           ]
       ),
       sexForSearch:blockerbot.inlineKeyboard(
           [
               [blockerbot.inlineButton('دختر', {callback:  "sexs-w"})],
               [blockerbot.inlineButton('پسر', {callback:  "sexs-m"})],
               [blockerbot.inlineButton('فرقی نمیکند', {callback:  "sexs-n"})]
           ]
       ),
       ageForSearch:blockerbot.inlineKeyboard(
           [
               [blockerbot.inlineButton('کوچکتر', {callback:  "ages-y"})],
               [blockerbot.inlineButton('بزرگتر', {callback:  "ages-o"})],
               [blockerbot.inlineButton('فرقی نمیکند', {callback:  "ages-n"})]
           ]
       ),
           comment:bot.keyboard([
               ['جستوجو'],
               ['تغییر سن','تغییر جنسیت','تغییر عکس'],
               ['ارسال نظر','بلاکی ها','تغییر شهر']], {resize: true}),
           cancel:bot.keyboard([['انصراف']], {resize: true}),
           cancelChat:bot.keyboard([['بلاک کردن','انصراف از چت']], {resize: true}),
           cancelSearching:bot.keyboard([['انصراف از جستوجو']], {resize: true}),
           cancelCity:bot.keyboard([['انصراف از تغییر شهر']], {resize: true}),
           cancelPhoto:bot.keyboard([['انصراف از تغییر عکس']], {resize: true}),


   }
}
